[
    {
        "name": "จุฬาลงกรณ์มหาวิทยาลัย"
    },
    {
        "name": "มหาวิทยาลัยเกษตรศาสตร์"
    },
    {
        "name": "มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตกำแพงแสน"
    },
    {
        "name": "มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตศรีราชา"
    },
    {
        "name": "มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตเฉลิมพระเกียรติสกลนคร"
    },
    {
        "name": "มหาวิทยาลัยเกษตรศาสตร์ โครงการจัดตั้งวิทยาเขตสุพรรณบุรี"
    },
    {
        "name": "มหาวิทยาลัยเกษตรศาสตร์ บางเขน"
    },
    {
        "name": "มหาวิทยาลัยขอนแก่น"
    },
    {
        "name": "มหาวิทยาลัยขอนแก่น วิทยาเขตหนองคาย"
    },
    {
        "name": "มหาวิทยาลัยเชียงใหม่"
    },
    {
        "name": "มหาวิทยาลัยธรรมศาสตร์"
    },
    {
        "name": "มหาวิทยาลัยธรรมศาสตร์ ศูนย์ลำปาง"
    },
    {
        "name": "มหาวิทยาลัยธรรมศาสตร์ ศูนยรังสิต"
    },
    {
        "name": "มหาวิทยาลัยธรรมศาสตร์ ศูนยถาวร-อุษา ประภา(ศูนย์พัทยา)"
    },
    {
        "name": "มหาวิทยาลัยมหิดล"
    },
    {
        "name": "มหาวิทยาลัยมหิดล วิทยาเขตกาญจนบุรี"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง วิทยาเขตบางนา"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดเชียงราย"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดขอนแก่น"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดหนองบัวลำภู"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดปราจีนบุรี"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดชัยภูมิ"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดเพชรบูรณ์"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดอุทัยธานี"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดอุดรธานี"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดลพบุรี"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดอำนาจเจริญ"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดแพร่"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดสุรินทร์"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดพังงา"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดนครพนม"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดตรัง"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดศรีสะเกษ"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดเชียงใหม่"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดบุรีรัมย์"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดนครราชสีมา"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดนครศรีธรรมราช"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดสุโขทัย"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดสงขลา"
    },
    {
        "name": "มหาวิทยาลัยรามคำแหง สาขาวิทยบริการเฉลิมพระเกียรติจังหวัดกาญจนบุรี"
    },
    {
        "name": "มหาวิทยาลัยศิลปากร"
    },
    {
        "name": "มหาวิทยาลัยศิลปากร วิทยาเขตพระราชวังสนามจันทร์"
    },
    {
        "name": "มหาวิทยาลัยศิลปากร วิทยาเขตสารสนเทศเพชรบุรี"
    },
    {
        "name": "มหาวิทยาลัยศรีนครินทรวิโรฒ"
    },
    {
        "name": "มหาวิทยาลัยศรีนครินทรวิโรฒ องครักษ์"
    },
    {
        "name": "มหาวิทยาลัยสงขลานครินทร์"
    },
    {
        "name": "มหาวิทยาลัยสงขลานครินทร์ วิทยาเขตปัตตานี"
    },
    {
        "name": "มหาวิทยาลัยสงขลานครินทร์ วิทยาเขตภูเก็ต"
    },
    {
        "name": "มหาวิทยาลัยสงขลานครินทร์ วิทยาเขตสุราษฎร์ธานี"
    },
    {
        "name": "มหาวิทยาลัยสงขลานครินทร์ วิทยาเขตตรัง"
    },
    {
        "name": "มหาวิทยาลัยสุโขทัยธรรมาธิราช"
    },
    {
        "name": "สถาบันบัณฑิตพัฒนบริหารศาสตร์"
    },
    {
        "name": "สถาบันบัณฑิตพัฒนบริหารศาสตร์ โครงการจัดการศึกษาศูนย์นอกสถานที่ตั้งจังหวัดชลบุรี"
    },
    {
        "name": "สถาบันบัณฑิตพัฒนบริหารศาสตร์ โครงการจัดการศึกษาศูนย์นอกสถานที่ตั้งศูนย์การศึกษาอำเภอสีคิ้ว"
    },
    {
        "name": "สถาบันบัณฑิตพัฒนบริหารศาสตร์ โครงการจัดการศึกษาศูนย์นอกสถานที่ตั้งจังหวัดอุดรธานี"
    },
    {
        "name": "สถาบันบัณฑิตพัฒนบริหารศาสตร์ โครงการจัดการศึกษาศูนย์นอกสถานที่ตั้งจังหวัดพิษณุโลก"
    },
    {
        "name": "สถาบันบัณฑิตพัฒนบริหารศาสตร์ โครงการจัดการศึกษาศูนย์นอกสถานที่ตั้งจังหวัดภูเก็ต"
    },
    {
        "name": "สถาบันบัณฑิตพัฒนบริหารศาสตร์ โครงการจัดการศึกษาศูนย์นอกสถานที่ตั้งจังหวัดสุราษฎร์ธานี"
    },
    {
        "name": "สถาบันบัณฑิตพัฒนบริหารศาสตร์ โครงการจัดการศึกษาศูนย์นอกสถานที่ตั้งศูนย์การศึกษาสำนักงานนิคมอุตสาหกรรมมาบตาพุด"
    },
    {
        "name": "สถาบันบัณฑิตพัฒนบริหารศาสตร์ โครงการจัดการศึกษาศูนย์การศึกษานอกที่ตั้งจังหวัดยะลา"
    },
    {
        "name": "มหาวิทยาลัยแม่โจ้"
    },
    {
        "name": "มหาวิทยาลัยแม่โจ้ - แพร่ ฉลิมพระเกียรติ"
    },
    {
        "name": "มหาวิทยาลัยแม่โจ้ - ชุมพร"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี วิทยาเขตราชบุรี"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ วิทยาเขตปราจีนบุรี"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ วิทยาเขตระยอง"
    },
    {
        "name": "สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณหทารลาดกระบัง"
    },
    {
        "name": "สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณหทารลาดกระบัง วิทยาเขตชุมพรเขตรอุดมศักดิ์"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีสุรนารี"
    },
    {
        "name": "มหาวิทยาลัยอุบลราชธานี"
    },
    {
        "name": "มหาวิทยาลัยอุบลราชธานี วิทยาเขตมุกดาหาร"
    },
    {
        "name": "มหาวิทยาลัยบูรพา"
    },
    {
        "name": "มหาวิทยาลัยบูรพา วิทยาเขตจันทบุรี"
    },
    {
        "name": "มหาวิทยาลัยบูรพา วิทยาเขตสระแก้ว"
    },
    {
        "name": "มหาวิทยาลัยนเรศวร"
    },
    {
        "name": "มหาวิทยาลัยมหาสารคาม"
    },
    {
        "name": "มหาวิทยาลัยทักษิณ วิทยาเขตสงขลา"
    },
    {
        "name": "มหาวิทยาลัยทักษิณ วิทยาเขตพัทลุง"
    },
    {
        "name": "มหาวิทยาลัยวลัยลักษณ์"
    },
    {
        "name": "มหาวิทยาลัยแม่ฟ้าหลวง"
    },
    {
        "name": "มหาวิทยาลัยนราธิวาสราชนครินทร์"
    },
    {
        "name": "มหาวิทยาลัยนครพนม"
    },
    {
        "name": "มหาวิทยาลัยพะเยา"
    },
    {
        "name": "มหาวิทยาลัยกรุงเทพ"
    },
    {
        "name": "มหาวิทยาลัยกรุงเทพ วิทยาเขตรังสิต"
    },
    {
        "name": "มหาวิทยาลัยกรุงเทพ วิทยาเขตกล้วยน้ำไท"
    },
    {
        "name": "มหาวิทยาลัยพายัพ"
    },
    {
        "name": "มหาวิทยาลัยศรีปทุม "
    },
    {
        "name": "มหาวิทยาลัยศรีปทุม วิทยาเขตชลบุรี"
    },
    {
        "name": "มหาวิทยาลัยศรีปทุม วิทยาเขตขอนแก่น"
    },
    {
        "name": "มหาวิทยาลัยหอการค้าไทย"
    },
    {
        "name": "มหาวิทยาลัยเกริก"
    },
    {
        "name": "มหาวิทยาลัยคริสเตียน"
    },
    {
        "name": "มหาวิทยาลัยเซนต์จอห์น"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีมหานคร"
    },
    {
        "name": "มหาวิทยาลัยรังสิต"
    },
    {
        "name": "มหาวิทยาลัยหัวเฉียวเฉลิมพระเกียรติ"
    },
    {
        "name": "มหาวิทยาลัยอัสสัมชัญ"
    },
    {
        "name": "มหาวิทยาลัยราชธานี"
    },
    {
        "name": "มหาวิทยาลัยราชธานี วิทยาเขตอุดรธานี"
    },
    {
        "name": "ศูนย์การศึกษามหาวิทยาลัยธนบุรี วิทยาลัยเทคโนโลยีหมู่บ้านครูภาคเหนือ จังหวัดลำพูน"
    },
    {
        "name": "มหาวิทยาลัยธนบุรี"
    },
    {
        "name": "มหาวิทยาลัยเจ้าพระยา  "
    },
    {
        "name": "มหาวิทยาลัยชินวัตร"
    },
    {
        "name": "มหาวิทยาลัยเวสเทิร์น"
    },
    {
        "name": "มหาวิทยาลัยธุรกิจบัณฑิตย์"
    },
    {
        "name": "มหาวิทยาลัยภาคตะวันออกเฉียงเหนือ"
    },
    {
        "name": "มหาวิทยาลัยฟาร์อีสเทอร์น"
    },
    {
        "name": "มหาวิทยาลัยภาคกลาง"
    },
    {
        "name": "มหาวิทยาลัยวงษ์ชวลิตกุล"
    },
    {
        "name": "มหาวิทยาลัยเว็บสเตอร์ (ประเทศไทย)"
    },
    {
        "name": "วิทยาลัยสันตพล"
    },
    {
        "name": "มหาวิทยาลัยเอเชียอาคเนย์"
    },
    {
        "name": "มหาวิทยาลัยอีสเทิร์นเอเชีย"
    },
    {
        "name": "มหาวิทยาลัยกรุงเทพธนบุรี"
    },
    {
        "name": "วิทยาลัยนานาชาติเซนต์เทเรซา"
    },
    {
        "name": "วิทยาลัยเซนต์หลุยส์"
    },
    {
        "name": "วิทยาลัยเซาธ์อีสท์บางกอก"
    },
    {
        "name": "วิทยาลัยดุสิตธานี"
    },
    {
        "name": "มหาวิทยาลัยตาปี"
    },
    {
        "name": "วิทยาลัยทองสุข"
    },
    {
        "name": "วิทยาลัยเทคโนโลยีภาคใต้"
    },
    {
        "name": "มหาวิทยาลัยนอร์ทกรุงเทพ"
    },
    {
        "name": "มหาวิทยาลัยนอร์ท-เชียงใหม่"
    },
    {
        "name": "มหาวิทยาลัยนานาชาติแสตมฟอร์ด"
    },
    {
        "name": "วิทยาลัยบัณฑิตเอเชีย"
    },
    {
        "name": "มหาวิทยาลัยปทุมธานี"
    },
    {
        "name": "มหาวิทยาลัยการจัดการและเทคโนโลยีอีสเทิร์น"
    },
    {
        "name": "มหาวิทยาลัยนานาชาติ เอเชีย-แปซิฟิก"
    },
    {
        "name": "มหาวิทยาลัยนานาชาติเอเชีย-แปซิฟิก วิทยาเขตกรุงเทพฯ"
    },
    {
        "name": "มหาวิทยาลัยหาดใหญ่"
    },
    {
        "name": "มหาวิทยาลัยเนชั่น"
    },
    {
        "name": "สถาบันรัชต์ภาคย์"
    },
    {
        "name": "มหาวิทยาลัยรัตนบัณฑิต"
    },
    {
        "name": "วิทยาลัยนอร์ทเทิร์น"
    },
    {
        "name": "วิทยาลัยแสงธรรม"
    },
    {
        "name": "มหาวิทยาลัยฟาฏอนี"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏกาญจนบุรี"
    },
    {
        "name": "มหาวิทยาลัยกาฬสินธุ์"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏกำแพงเพชร"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏชัยภูมิ"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏเชียงราย"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏเชียงใหม่"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏเทพสตรี"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏธนบุรี"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏนครปฐม"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏนครราชสีมา"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏนครศรีธรรมราช"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏพระนคร"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏพระนครศรีอยุธยา"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏพิบูลสงคราม"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏวไลยอลงกรณ์ ในพระบรมราชูปถัมภ์"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏเพชรบูรณ์"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏภูเก็ต"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏมหาสารคาม"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏยะลา"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏร้อยเอ็ด"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏราชนครินทร์"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏรำไพพรรณี"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏลำปาง"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏเลย"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏศรีสะเกษ"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏสงขลา"
    },
    {
        "name": "มหาวิทยาลัยสวนดุสิต"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏสวนสุนันทา"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏสุรินทร์"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏหมู่บ้านจอมบึง"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏอุดรธานี "
    },
    {
        "name": "มหาวิทยาลัยราชภัฏอุตรดิตถ์"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏอุบลราชธานี"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏนครสวรรค์"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏสุราษฎร์ธานี"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏบ้านสมเด็จเจ้าพระยา"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏสกลนคร"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏบุรีรัมย์"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏจันทรเกษม"
    },
    {
        "name": "มหาวิทยาลัยราชภัฏเพชรบุรี"
    },
    {
        "name": "มหาวิทยาลัยเกษมบัณฑิต"
    },
    {
        "name": "มหาวิทยาลัยสยาม"
    },
    {
        "name": "วิทยาลัยเชียงราย"
    },
    {
        "name": "มหาวิทยาลัยพิษณุโลก"
    },
    {
        "name": "วิทยาลัยพุทธศาสนานานาชาติ"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตหนองคาย"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตนครศรีธรรมราช"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตเชียงใหม่"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตขอนแก่น"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตนครราชสีมา"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตอุบลราชธานี"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตแพร่"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตสุรินทร์"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตพะเยา"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตบาฬีศึกษาพุทธโฆส"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยดองกุก ชอนบอบ"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์นครพนม"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์เลย"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์ลำพูน"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์นครสวรรค์"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์พุทธชินราช"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสมทบ"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์บุรีรัมย์"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์ปัตตานี"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์นครน่าน"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์นครลำปาง"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์พุทธโสธร"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์ศรีสะเกษ"
    },
    {
        "name": "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์เชียงราย"
    },
    {
        "name": "มหาวิทยาลัยมหามกุฏราชวิทยาลัย"
    },
    {
        "name": "มหาวิทยาลัยมหามกุฏราชวิทยาลัย วิทยาเขตมหาวชิราลงกรณราชวิทยาลัย"
    },
    {
        "name": "มหาวิทยาลัยมหามกุฏราชวิทยาลัย วิทยาเขตร้อยเอ็ด"
    },
    {
        "name": "มหาวิทยาลัยมหามกุฏราชวิทยาลัย วิทยาเขตล้านนา"
    },
    {
        "name": "มหาวิทยาลัยมหามกุฏราชวิทยาลัย วิทยาเขตศรีธรรมาโศกราช"
    },
    {
        "name": "มหาวิทยาลัยมหามกุฏราชวิทยาลัย วิทยาเขตศรีล้านช้าง"
    },
    {
        "name": "มหาวิทยาลัยมหามกุฏราชวิทยาลัย วิทยาเขตสิรินธรราชวิทยาลัย"
    },
    {
        "name": "มหาวิทยาลัยมหามกุฏราชวิทยาลัย วิทยาเขตอีสาน"
    },
    {
        "name": "มหาวิทยาลัยมหามกุฏราชวิทยาลัย มหาปชาบดีเถรีวิทยาลัย ในพระสังฆราชูปถัมภ์"
    },
    {
        "name": "มหาวิทยาลัยมหามกุฏราชวิทยาลัย วิทยาลัยศาสนศาสตร์ยโสธร"
    },
    {
        "name": "มหาวิทยาลัยมหามกุฏราชวิทยาลัย วิทยาลัยศาสนศาสตร์เฉลิมพระเกียรติกาฬสินธุ์"
    },
    {
        "name": "สถาบันเทคโนโลยีปทุมวัน"
    },
    {
        "name": "วิทยาลัยนครราชสีมา"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลธัญบุรี"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลธัญบุรี วิทยาเขตปทุมธานี"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลกรุงเทพ"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลกรุงเทพ วิทยาเขตเทคนิคกรุงเทพฯ"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลกรุงเทพ  วิทยาเขตบพิตรพิมุข มหาเมฆ"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลกรุงเทพ  วิทยาเขตพระนครใต้"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลตะวันออก"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลตะวันออก วิทยาเขตจักรพงษภูวนารถ"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลตะวันออก วิทยาเขตอุเทนถวาย"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลตะวันออก วิทยาเขตบางพระ"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลตะวันออก วิทยาเขตจันทบุรี"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลตะวันออก  คณะเกษตรศาสตร์บางพระ จังหวัดชลบุรี"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลพระนคร"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลพระนคร  วิทยาเขตเทเวศร์"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลพระนคร  วิทยาเขตโชติเวช"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลพระนคร  วิทยาเขตพณิชยการพระนคร"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลพระนคร  วิทยาเขตชุมพรเขตรอุดมศักดิ์"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลพระนคร  วิทยาเขตพระนครเหนือ"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์  วิทยาเขตเพาะช่าง"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์  วิทยาเขตบพิตรพิมุข จักรวรรดิ"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์  วิทยาเขตศาลายา"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์  วิทยาเขตวังไกลกังวล"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา  วิทยาเขตภาคพายัพจังหวัดเชียงใหม่"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา  น่าน"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา  ลำปาง"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา  เชียงราย"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา  ตาก"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา  พิษณุโลก"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา  สถาบันวิจัยและฝึกอบรมการเกษตรลำปาง"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลศรีวิชัย"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลศรีวิชัย  วิทยาเขตสงขลา"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลศรีวิชัย  วิทยาเขตนครศรีธรรมราช"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลศรีวิชัย  วิทยาเขตตรัง"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ  วิทยาเขตนนทบุรี"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ  วิทยาเขตพระนครศรีอยุธยา วาสุกรี"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ  วิทยาเขตพระนครศรีอยุธยา หันตรา"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ  วิทยาเขตสุพรรณบุรี"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน นครราชสีมา"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตสุรินทร์"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตขอนแก่น"
    },
    {
        "name": "มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตสกลนคร"
    },
    {
        "name": "มหาวิทยาลัยเฉลิมกาญจนา"
    },
    {
        "name": "วิทยาลัยเฉลิมกาญจนา  วิทยาเขตระยอง"
    },
    {
        "name": "วิทยาลัยอินเตอร์เทคลำปาง"
    },
    {
        "name": "สถาบันวิทยาลัยชุมชน"
    },
    {
        "name": "วิทยาลัยชุมชนแม่ฮ่องสอน"
    },
    {
        "name": "วิทยาลัยชุมชนพิจิตร"
    },
    {
        "name": "วิทยาลัยชุมชนตาก"
    },
    {
        "name": "วิทยาลัยชุมชนบุรีรัมย์"
    },
    {
        "name": "วิทยาลัยชุมชนมุกดาหาร"
    },
    {
        "name": "วิทยาลัยชุมชนหนองบัวลำภู"
    },
    {
        "name": "วิทยาลัยชุมขนสระแก้ว"
    },
    {
        "name": "วิทยาลัยชุมชนอุทัยธานี"
    },
    {
        "name": "วิทยาลัยชุมชนระนอง"
    },
    {
        "name": "วิทยาลัยชุมชนนราธิวาส"
    },
    {
        "name": "วิทยาลัยชุมชนยะลา"
    },
    {
        "name": "วิทยาลัยชุมชนปัตตานี"
    },
    {
        "name": "วิทยาลัยชุมชนสตูล"
    },
    {
        "name": "วิทยาลัยชุมชนสมุทรสาคร"
    },
    {
        "name": "วิทยาลัยชุมชนยโสธร"
    },
    {
        "name": "วิทยาลัยชุมชนพังงา"
    },
    {
        "name": "วิทยาลัยชุมชนตราด"
    },
    {
        "name": "วิทยาลัยชุมชนแพร่"
    },
    {
        "name": "วิทยาลัยชุมชนสงขลา"
    },
    {
        "name": "วิทยาลัยชุมชนน่าน"
    },
    {
        "name": "โรงเรียนนายร้อยพระจุลจอมเกล้า"
    },
    {
        "name": "โรงเรียนนายเรือ"
    },
    {
        "name": "โรงเรียนนายเรืออากาศ"
    },
    {
        "name": "วิทยาลัยแพทยศาสตร์พระมงกุฎเกล้า"
    },
    {
        "name": "วิทยาลัยพยาบาลกองทัพบก"
    },
    {
        "name": "วิทยาลัยพยาบาลกองทัพเรือ"
    },
    {
        "name": "วิทยาลัยพยาบาลทหารอากาศ"
    },
    {
        "name": "โรงเรียนนายร้อยตำรวจ"
    },
    {
        "name": "วิทยาลัยพยาบาลตำรวจ"
    },
    {
        "name": "ศูนย์ฝึกพาณิชย์นาวี"
    },
    {
        "name": "สถาบันพระบรมราชชนก"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี กรุงเทพ"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี  ขอนแก่น"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี จักรีรัช"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี ชลบุรี"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี ชัยนาท"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี เชียงใหม่"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี ตรัง"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี นนทบุรี"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี นพรัตน์วชิระ"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี นครลำปาง"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี นครราชสีมา"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี นครศรีธรรมราช"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี พระพุทธบาท"
    },
    {
        "name": "วิทยาลัยพยาบาลพระจอมเกล้า เพชรบุรี"
    },
    {
        "name": "วิทยาลัยพยาบาลพระปกเกล้า จันทบุรี"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี พุทธชินราช"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี พะเยา"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี ยะลา"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี ราชบุรี"
    },
    {
        "name": "วิทยาลัยพยาบาลศรีมหาสารคาม"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี สระบุรี"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี สุพรรณบุรี"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี สวรรค์ประชารักษ์"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี สุรินทร์"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี สรรพสิทธิประสงค์ อุบลราชธานี"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี สุราษฎร์ธานี"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี สงขลา"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี อุตรดิตถ์"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี อุดรธานี"
    },
    {
        "name": "วิทยาลัยการสาธารณสุขสิรินธร ขอนแก่น"
    },
    {
        "name": "วิทยาลัยการสาธารณสุขสิรินธร ชลบุรี"
    },
    {
        "name": "วิทยาลัยการสาธารณสุขสิรินธร ตรัง"
    },
    {
        "name": "วิทยาลัยการสาธารณสุขสิรินธร พิษณุโลก"
    },
    {
        "name": "วิทยาลัยการสาธารณสุขสิรินธร ยะลา"
    },
    {
        "name": "วิทยาลัยการสาธารณสุขสิรินธร สุพรรณบุรี"
    },
    {
        "name": "วิทยาลัยพยาบาลสรรพสิทธิประสงค์ อุบลราชธานี"
    },
    {
        "name": "วิทยาลัยการสาธารณสุขสิรินธร อุบลราชธานี"
    },
    {
        "name": "วิทยาลัยเทคโนโลยีทางการแพทย์และสาธารณสุข กาญจนาภิเษก"
    },
    {
        "name": "วิทยาลัยพยาบาลบรมราชชนนี แพร่"
    },
    {
        "name": "วิทยาลัยแพทยศาสตร์กรุงเทพมหานครและวชิรพยาบาล"
    },
    {
        "name": "วิทยาลัยพยาบาลเกื้อการุณย์"
    },
    {
        "name": "วิทยาลัยการชลประทาน"
    },
    {
        "name": "สถาบันการพยาบาลศรีสวรินทิรา สภากาชาดไทย"
    },
    {
        "name": "สถาบันบัณฑิตพัฒนศิลป์"
    },
    {
        "name": "มหาวิทยาลัยการกีฬาแห่งชาติ"
    },
    {
        "name": "มหาวิทยาลัยการกีฬาแห่งชาติ วิทยาเขตกระบี่"
    },
    {
        "name": "มหาวิทยาลัยการกีฬาแห่งชาติ วิทยาเขตกรุงเทพ"
    },
    {
        "name": "มหาวิทยาลัยการกีฬาแห่งชาติ วิทยาเขตชลบุรี"
    },
    {
        "name": "มหาวิทยาลัยการกีฬาแห่งชาติ วิทยาเขตชัยภูมิ"
    },
    {
        "name": "มหาวิทยาลัยการกีฬาแห่งชาติ วิทยาเขตชุมพร"
    },
    {
        "name": "มหาวิทยาลัยการกีฬาแห่งชาติ วิทยาเขตเชียงใหม่"
    },
    {
        "name": "มหาวิทยาลัยการกีฬาแห่งชาติ วิทยาเขตตรัง"
    },
    {
        "name": "มหาวิทยาลัยการกีฬาแห่งชาติ วิทยาเขตเพชรบูรณ์"
    },
    {
        "name": "มหาวิทยาลัยการกีฬาแห่งชาติ วิทยาเขตมหาสารคาม"
    },
    {
        "name": "มหาวิทยาลัยการกีฬาแห่งชาติ วิทยาเขตยะลา"
    },
    {
        "name": "มหาวิทยาลัยการกีฬาแห่งชาติ วิทยาเขตลำปาง"
    },
    {
        "name": "มหาวิทยาลัยการกีฬาแห่งชาติ วิทยาเขตศรีสะเกษ"
    },
    {
        "name": "มหาวิทยาลัยการกีฬาแห่งชาติ วิทยาเขตสมุทรสาคร"
    },
    {
        "name": "มหาวิทยาลัยการกีฬาแห่งชาติ วิทยาเขตสุโขทัย"
    },
    {
        "name": "มหาวิทยาลัยการกีฬาแห่งชาติ วิทยาเขตสุพรรณบุรี"
    },
    {
        "name": "มหาวิทยาลัยการกีฬาแห่งชาติ วิทยาเขตอ่างทอง"
    },
    {
        "name": "มหาวิทยาลัยการกีฬาแห่งชาติ วิทยาเขตอุดรธานี"
    },
    {
        "name": "สถาบันการบินพลเรือน"
    },
    {
        "name": "มหาวิทยาลัยกรุงเทพสุวรรณภูมิ"
    },
    {
        "name": "วิทยาลัยเทคโนโลยีสยาม"
    },
    {
        "name": "วิทยาลัยเทคโนโลยีสยาม วิทยาเขตราชบุรี"
    },
    {
        "name": "มหาวิทยาลัยราชพฤกษ์"
    },
    {
        "name": "ราชวิทยาลัยจุฬาภรณ์"
    },
    {
        "name": "สถาบันเทคโนโลยีไทย-ญี่ปุ่น"
    },
    {
        "name": "สถาบันอาศรมศิลป์"
    },
    {
        "name": "สถาบันวิทยาการประกอบการแห่งอโยธยา"
    },
    {
        "name": "วิทยาลัยเฉลิมกาญจนาระยอง"
    },
    {
        "name": "สถาบันการจัดการปัญญาภิวัฒน์"
    },
    {
        "name": "สถาบันการจัดการปัญญาภิวัฒน์ วิทยาเขตอีอีซี"
    },
    {
        "name": "วิทยาลัยเทคโนโลยีพนมวันท์"
    },
    {
        "name": "วิทยาลัยพิชญบัณฑิต"
    },
    {
        "name": "สถาบันกันตนา"
    },
    {
        "name": "สถาบันการเรียนรู้เพื่อปวงชน"
    },
    {
        "name": "สถาบันเทคโนโลยียานยนต์มหาชัย"
    },
    {
        "name": "สถาบันดนตรีกัลยาณิวัฒนา"
    },
    {
        "name": "มหาวิทยาลัยนวมินทราธิราช"
    },
    {
        "name": "วิทยาลัยเทคโนโลยีจิตรลดา"
    },
    {
        "name": "สถาบันวิทยาการจัดการแห่งแปซิฟิค"
    },
    {
        "name": "สถาบันเทคโนโลยีแห่งสุวรรณภูมิ"
    },
    {
        "name": "สถาบันวิทยสิริเมธี"
    },
    {
        "name": "โรงเรียนเสนาธิการทหารบก"
    },
    {
        "name": "วิทยาลัยนานาชาติราฟเฟิลส์"
    }
]