[
   {
      "choice": "จำเป็นต้องใส่ อัฒภาค (Semi-Colon ;)  ทุกครั้ง เมื่อเริ่มต้นคำสั่ง "
   },
   {
      "choice": "จำเป็นต้องใส่ อัฒภาค (Semi-Colon ;)  ทุกครั้ง เมื่อสิ้นสุดคำสั่ง"
   },
   {
      "choice": "การเว้นวรรคเป็นส่วนหนึ่งของไวยกรณ์ (Syntax)  "
   },
   {
      "choice": "อัญประกาศ (Double Quote “ ) ใช้สำหรับข้อมูลข้อความที่มีตัวอักษรมากกว่าหนึ่งตัวเท่านั้น"
   },
   {
      "choice": "อัญประกาศเดี่ยว (Single Quote  ‘) ใช้สำหรับข้อมูลตัวอักษร 1 ตัวเท่านั้น "
   },
   {
      "choice": "อัญประกาศ (Double Quote “) และ อัญประกาศเดี่ยว (Single Quote ‘) สามารถข้อมูลตัวอักษร 1 ตัว หรือ มากกว่านั้นก็ได้ "
   },
   {
      "choice": "เราสามารถเพิ่มตัวอักษรให้ string ด้วยคำสั่งลักษณะนี้ my_string += “add string”"
   },
   {
      "choice": "ลิสต์ (List) มีการเรียงลำดับข้อมูล ไม่สามารถเปลี่ยนแปลงข้อมูล และ สามารถมีข้อมูลซ้ำได้"
   },
   { "choice": "ในการประกาศ ตัวแปร ข้อมูลประเภทลิสต์ (List) ต้องมีการประกาศขนาดของข้อมูลเสมอ" },
   {
      "choice": "ในการประกาศ ตัวแปร ข้อมูลประเภทลิสต์ (List) ต้องมีการะบุประเภทข้อมูลที่เก็บในลิสต์เสมอ"
   },
   {
      "choice": "เซ็ต (Set) ไม่มีการเรียงลำดับข้อมูล สามารถเปลี่ยนแปลงข้อมูล และ ไม่สามารถมีข้อมูลซ้ำได้ "
   },
   {
      "choice": "เซ็ต (Set) เมื่อมีการเพิ่มข้อมูล จะทำการลบข้อมูลในลำดับแรกออก และ แทนที่ข้อมูลใหม่เข้า"
   },
   {
      "choice": "เซ็ต (Set) เมื่อมีการเพิ่มข้อมูล จะทำการลบข้อมูลในลำดับสุดท้ายออก และ แทนที่ข้อมูลใหม่เข้า"
   },
   {
      "choice": "ทูเพิล (Tuple) ไม่มีการเรียงลำดับข้อมูล สามารถเปลี่ยนแปลงข้อมูล และ ไม่สามารถมีข้อมูลซ้ำได้ "
   },
   {
      "choice": "ทูเพิล (Tuple)   มีการเรียงลำดับข้อมูล ไม่สามารถเปลี่ยนแปลงข้อมูล  และ สามารถมีข้อมูลซ้ำได้ "
   },
   {
      "choice": "ดิกชันนารี (Dictionary) โครงสร้างหลักประกอบด้วย Key และ Value"
   },
   {
      "choice": "ดิกชันนารี (Dictionary) สามารถแปลงเป็นลิสต์ (List) ได้ โดยใช้ฟังก์ชัน list()"
   },
   {
      "choice": "[i for i in range(8)] ผลลัพธ์คือ [1, 2, 3, 4, 5, 6, 7, 8]"
   },
   {
      "choice": "[i for i in range(2, 6)] ผลลัพธ์คือ [2, 3, 4, 5, 6]"
   },
   {
      "choice": "[i for i in range(7, 3, -1)] ผลลัพธ์คือ [7, 6, 5, 4]"
   },
   {
      "choice": "การประกาศฟังชัน ไม่จำเป็นต้องส่งค่าคืน (Return) ทุกครั้ง "
   },
   {
      "choice": "คำสั่ง as ซึ่งใช้งานร่วมกับคำสั่ง import ใช้สำหรับเจาะจงฟังก์ชันในไลบรารี่ (Library) ที่ต้องการนำเข้าโดยเฉพาะ"
   }
]
